const JOB_POSTING_DETAIL_DATA = {
  jobPostingId: '1',
  jobPostingTitle: 'Frontend Developer',
  workType: '재택대면혼합근무',
  createdAt: '2021-10-20',
  applicantCount: '1234567',
  isEasyApply: true,
  employmentType: '풀타임',
  description: `[팀 소개]
  버킷플레이스(오늘의집)는 온라인 인테리어 분야에서 빠르게 성장하는 기업입니다. 우리는 고객, 직원, 파트너 그리고 우리를 아는 모든 사람들의 일상을 어떻게 변화시킬 수 있는지 매 순간 고민합니다.

  • 커머스 팀
  커머스 팀은 오늘의집 스토어를 No.1 홈퍼니싱 커머스 플랫폼으로 성장시키는 것을 목표로 하고 있습니다. 오늘의집 사용자가 빠르게 원하는 상품을 발견, 구매하고, 이후 처리되는 전 과정에서의 사용자 경험을 개선하고 고객 가치를 극대화 합니다.

  • 물류배송 팀
  물류배송 팀은 오늘의집에서 배송 관련 운영 및 기획을 책임지는 팀 입니다. 물류배송 운영의 기틀을 잡고, 효율을 개선하여 고객 만족 극대화에 대한 책임을 집니다. 또한 인테리어 시장에 최적화된 물류배송 시스템을 만듭니다.

  • 콘텐츠 팀
  콘텐츠 팀은 오늘의집에 최적화된 콘텐츠 포맷을 개발 및 운영하고, 사용자가 집을 꾸밀 수 있는 방법을 보다 빠르고 정확하게 찾을 수 있는 서비스 제공을 목표로 하고 있습니다.

  • O2O서비스 팀
  시공서비스 팀은 유저에게 더 쉽고 빠르게 좋은 시공 업체를 제안하기 위한 서비스를 만듭니다. 또한, 인테리어/시공 O2O 시장에서 가장 좋은 서비스를 만들어, 고객에게 최고의 가치를 제공하기 위해 노력할 것입니다.

  [주요업무]
  • 클라우드 환경에서의 대용량 트래픽 아키텍처 설계, 개발 및 분산 컴퓨팅 솔루션 구축
  • Spring Framework + Kotlin, Ruby on Rails를 사용하여 서비스 구축
  • 고 가용성, 확장성 있는 API 설계 및 개발
  • 서비스 운영을 위한 Back office, 판매자 페이지 개발 및 개선
  • 서비스 아키텍처 설계부터 출시까지 전 과정 참여
  • MSA를 위한 서비스 Re-Architecting

  [자격요건]
  • 백엔드 개발 경력 5~10년 이상
  • 커머스 도메인에서 개발 경험이 1년 이상 있으신 분
  • Kotlin/Java/Python/Ruby 등 하나 이상의 프로그래밍 언어 전문성이 있는 분
  • Cloud 기반 환경에서 1년 이상 서비스 설계 및 구축, 운영 경험이 있는 분
  • 제한된 상황에서 문제를 풀기 위한 최적의 솔루션을 찾을 수 있는 분
  • RDBMS 및 다양한 NoSQL 데이터베이스에 대한 지식이 있는 분
  • 전체 SDLC(소프트웨어 생명주기)에 대한 경험이 있는 분

  [우대사항]
  • 컴퓨터공학 전공 혹은 그에 준하는 전공자
  • 대용량 서비스 아키텍처 및 데이터 처리에 대한 경험이 있으신 분
  • MSA 아키텍처에 대해 설계하고 개발해보신 분
  • Agile, Lean 방식의 프로세스에서 개발해보신 분
  • React에 대한 이해 및 간단한 개발이 가능하신 분
  • 인테리어 산업에 대한 관심과 이해도가 높으신 분
  `,
  salaryRange: '3500만원 ~ 7000만원',
  salaryInfo:
    '만약에 연봉 정보가 있다면 이렇게 표시되겠군요. 실제로 본 적은 아직 없습니다.',
  companyId: '1',
  profileImgUrl:
    'https://media-exp1.licdn.com/dms/image/C510BAQFh_R_8BB6CwA/company-logo_100_100/0/1526533379832?e=1643241600&v=beta&t=5WuqDyG1nJjEj0II2afusiQ-gRb2-d7BbEmsi3lCRDg',
  companyName: 'Bucketplace (오늘의집)',
  companyCategory: 'IT',
  companyLocation: '서울, 대한민국',
  staffCount: '12,001 - 53,000',
  followerCount: '123456',
  companyIntroduction: `[오늘의집 비전]
  "No.1 Lifestyle Tech Company"
  
  오늘의집이 도전하고 있는 리빙 시장은 총 규모 10조 이상의 거대한 시장입니다. 
  가구, 소품, 인테리어 시공 등 많은 영역들이 아직까지 지역 중심의 오프라인 모델로 남아있어 발전 가능성이 무궁무진한 분야이기도 합니다.
  
  오늘의집은 소수의 전유물이었던 거대한 규모의 인테리어 시장의 중심을 온라인으로 옮겨오고자 합니다. 
  그리고 "누구나 예쁜 집에 살 수 있어" 라는 우리의 모토처럼 좋은 공간이 주는 행복을 오늘의집을 통해 누구나 누릴 수 있기를 진심으로 바랍니다.
  
  오늘의집은 인테리어 원스톱 플랫폼으로서 무형의 서비스를 넘어 세상의 공간들이 물리적으로 바뀌어 나가는 것을 촉진하고, 이를 통해 사람들의 삶을 더 나은 방향으로 변화시켜 나갈 것 입니다.
  
  라이프스타일 시장을 혁신하는 No.1 Lifestyle Tech Company 오늘의집에서 함께 하실 여러분을 기다립니다!
  
  
  [오늘의집 서비스 소개]
  "누구나 예쁜 집에 살 수 있어"
  
  우리는 올인원 라이프스타일 플랫폼 "오늘의집"을 통해 집을 꾸미는 방식을 새롭게 정의합니다.
  취향에 맞는 인테리어 콘텐츠 탐색, 현실로 구현하기 위한 구매 의사결정, 믿을만한 시공 전문가 중개까지 인테리어의 모든 과정을 오늘의집에서 할 수 있습니다.
  
  • 마음에 드는 예쁜 집을 모아 보고 인테리어 노하우를 주고 받는 "콘텐츠 서비스"
  • 태그 버튼을 통해 사진 속 소품과 가구를 바로 구매하고, 다양한 인테리어&라이프스타일 상품 쇼핑이 가능한 "커머스 서비스"
  • 역량이 검증된 인테리어 전문가와 소비자를 온라인에서 빠르게 연결해주는 "인테리어 시공 중개 서비스"
  
  오늘의집은 좋은 공간이 사람들의 삶을 변화시킨다고 믿고 있습니다.
  더 많은 사람들이 오늘의집을 통해 개인의 공간에 관심을 갖게 되고 변화시키면서 공간을 통해 작은 행복, 위안, 즐거움, 소중한 위로를 얻기를 바라기에, 매일 더 좋은 서비스를 만들기 위해 노력합니다.
  
  
  [오늘의집 CEO(제이님) 인터뷰 영상]
  • EO: https://ozip.me/ghixebL
  • 유퀴즈온더블럭: https://ozip.me/KJeViKG
  
  
  [오늘의집 성과] 
  • 오늘의집, 770억원 규모 글로벌 투자 유치 [https://ozip.me/Q7jxLxX]
  • 30개월 매출 '제로' 견딘 스타트업, 펜더믹 집콕 시대 국민 인테리어앱 되다 [https://ozip.me/4diWjZt]
  • '오늘의집' 누적 다운로드 2천만건 돌파 [https://ozip.me/3Hgmc5g]`,
  jobPostingCount: 49,
};

export default JOB_POSTING_DETAIL_DATA;
