{
  "jobPostingId": 3,
  "jobPostingTitle": "[LuxPM]  React Developer for Innovative AI IoT management system",
  "workType": "On-site",
  "timeSincePosted": "2일 전",
  "applicantCount": 3,
  "isEasyApply": 1,
  "employmentType": "Full-time",
  "description": "[LuxPM]  React Developer for Innovative AI IoT management system",
  "salaryRange": "",
  "companyId": 3,
  "companyProfileImageUrl": "https://media-exp1.licdn.com/dms/image/C560BAQEon8CuwIF0TQ/company-logo_100_100/0/1624849426297?e=1643241600&v=beta&t=YKkCBEkLOeBcyyO-W8WIsL7rv1j-u0fVE9vms7miwnk",
  "companyName": "LuxPm",
  "companyCategory": "Computer Software  ",
  "companyLocation": "Seoul, South Korea",
  "staffCount": "1-50",
  "companyIntroduction": "We are a software development company based in Seoul, South Korea. LuxPM provides state-of-the-art solutions in Artificial Intelligence, Mobile App Development, Website Application Development, UI/UX Design Services, Big Data Services, and Automation. We have worked with several fortune 500 companies across the globe.\n\nOur vision is to be the most accessible and globalized software development company in the Asia-Pacific region. We make it our goal to solve some of the most challenging problems existing in various industries at a reasonable cost and efficient timeline.\n\nWithin our industry of problem-solving, there is another type of challenge we are passionate about – globalization. Being a global company is not an easy task, yet we are striving to be a company open to people from all walks of life. We make everyone feel welcome to work with us.",
  "companyDetailImages": null,
  "authorId": 3,
  "authorFirstName": "Young ",
  "authorLastName": "Yu",
  "authorProfileImageUrl": "https://images.unsplash.com/photo-1635519514639-ee2bcd35ef37?ixid=MnwxMjA3fDB8MHxlZGl0b3JpYWwtZmVlZHw3Nnx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
  "authorPosition": " software developer  ",
  "jobPostingContent": "LuxPM's Footprints\n\nLuxPM has recently launched its outposts in Malaysia, Vietnam, Indonesia, Singapore, and India.\n\n\nWe are currently building an innovative ERP platform for factory management that monitors and control real-time data for energy and resource optimization.\n\n\nWho you are\n\nOur goal with the project is to bring this to the global market with the support of our teams based in Seoul, Ho Chi Minh, Singapore, Kiev, New Delhi, Kuala Lumpur and Jakarta.\n\n\nWe are looking for someone who is not afraid of facing challenges, but willing to go above and beyond for solving problems.\n\n\nCompensations\n\nCompetitive salary\nMajor Benefits\n\nResponsibilities\n\nOur company, LuxPM, believes in mutual growth, and that's what we value the most. The people's company. As part of the company, you will be in charge of the frontend development for our integrated sales platform.\n\n\nBuild features for AI IoT applications\nBuild the key framework for all of the microservices.\nIntegrate multiple microservices into the main structure.\nCommunicate with overseas teams that are based in Vietnam, Indonesia and Ukraine that are building other microservices.\nKeep track of the progress of each and every feature and provide feedback to the overseas teams.\nPerform functionality test and code review on the features\n\nYour Expertise\n\nAt least 3 years of experience in mobile, web, or other software\nAt least 3 years of experience in Node JS\nA major in computer science or engineering is preferred but is not a must\nExcellent communication skills - Especially in English. We are a global company!\nAn entrepreneurial mindset. Willingness to solve challenging problems"
}
