{
  "jobPostingId": 4,
  "jobPostingTitle": "Senior React Native Developer",
  "workType": "Remote",
  "timeSincePosted": "2일 전",
  "applicantCount": 2,
  "isEasyApply": 1,
  "employmentType": "Contract",
  "description": "Senior React Native Developer",
  "salaryRange": "",
  "companyId": 4,
  "companyProfileImageUrl": "https://media-exp1.licdn.com/dms/image/C560BAQEJlZg66jWL4w/company-logo_100_100/0/1580139518352?e=1643241600&v=beta&t=wAH9HbUREnZvf5j0TptyWFexp83-LiL2uqHBpsMMtD4",
  "companyName": "Toptal",
  "companyCategory": "Internet  ",
  "companyLocation": "Incheon, South Korea",
  "staffCount": "100-500",
  "companyIntroduction": "Toptal is a network of the world's top talent in business, design, and technology that enables companies to scale their teams, on demand. With $200+ million in annual revenue and over 40% year-over-year growth, Toptal is the largest fully distributed workforce in the world.",
  "companyDetailImages": null,
  "authorId": 4,
  "authorFirstName": "Sean",
  "authorLastName": "Middleton",
  "authorProfileImageUrl": "https://images.unsplash.com/photo-1621609764095-b32bbe35cf3a?ixid=MnwxMjA3fDF8MHxlZGl0b3JpYWwtZmVlZHwxMDR8fHxlbnwwfHx8fA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
  "authorPosition": " training and development manager  ",
  "jobPostingContent": "About The Job\n\nToptal developers work with speed and efficiency to deliver the highest quality of work. We are looking for someone who is passionate about their client’s business, and ready to work on exciting projects with Fortune 500 companies and Silicon Valley startups, with great rates and zero hassles. If you are looking for a place to advance your career, enhance your skill set, and build connections around the globe, Toptal is right for you.\n\nAbout Toptal\n\nToptal is an exclusive network of top freelancers from around the world. Fortune 500 companies and Silicon Valley startups hire Toptal for their most important projects. Toptal is one of the fastest-growing fully remote networks and empowers freelance software developers, designers, finance experts, product managers, and project managers worldwide to grow and excel in their freelance careers.\n\nToptal clients vary in sizes and industries, from enterprise organizations and big tech companies to Silicon Valley startups and renowned universities. Once you enter the network, our matchers will contact you with project opportunities that fit your expertise and preferences. We have experts in over 120 countries who get to work remotely on projects that meet their career ambitions.\n\nAbout The Role\n\nWe are looking for a React Native developer interested in building performant mobile apps on both the iOS and Android platforms. Your primary responsibilities might vary from: (1) build smooth UIs across both mobile platforms, (2) leverage native APIs for deep integrations with both platforms, (3) diagnose and fix bugs and performance bottlenecks for performance that feels native, (4) reach out to the open source community to encourage and help implement mission-critical software fixes—React Native moves fast and often breaks things, (5) maintain code and write automated tests to ensure the product is of the highest quality, and (6) transition existing React web apps to React Native.\n\nRequirements\n3+ years of professional experience in software development\nExperience creating React Native mobile solutions for Android and iOS\nFirm grasp of the JavaScript language and its nuances, including ES6+ syntax\nAbility to write well-documented, clean Javascript code\nRock solid at working with third-party dependencies and debugging dependency conflicts\nFamiliarity with native build tools, like XCode, Gradle\nUnderstanding of REST APIs, the document request model, and offline storage\nExperience with automated testing suites\nExperience with system architecture or leading a software team is a strong advantage\nFull-time availability is a strong advantage\nIf you’re interested in pursuing an engaging career working on full-time freelance jobs for exclusive clients, take the next step by clicking apply and filling out the short form to get started.\n\n#RemoteJobReactNative\n"
}
