const guideCard = [
  {
    id: 1,
    title: '리크루터에게 구직의사를 밝히세요!',
    desc: '많은 채용담당자에게 연락을 받을 수 있습니다.',
  },
  {
    id: 2,
    title: '채용중이라고 널리 알리세요!',
    desc: '보다 우수한 지원자를 쉽게 모으세요',
  },
  {
    id: 3,
    title: '프리랜서 활동중이라고 알리세요!',
    desc: '더 많은 클라이언트를 유치할 수 있습니다.',
  },
  {
    id: 4,
    title: '리크루터에게 구직의사를 밝히세요!',
    desc: '많은 채용담당자에게 연락을 받을 수 있습니다.',
  },
  // {
  //   id: 5,
  //   title: '채용중이라고 널리 알리세요!',
  //   desc: '보다 우수한 지원자를 쉽게 모으세요',
  // },
  // {
  //   id: 6,
  //   title: '프리랜서 활동중이라고 알리세요!',
  //   desc: '더 많은 클라이언트를 유치할 수 있습니다.',
  // },
];

export default guideCard;
